contiki-ng/contiki-ng/arch/cpu/nrf52840/rf/nrf52840-ieee.c
/*---------------------------------------------------------------------------*/
static bool
phr_is_valid(uint8_t phr)
{
  if(phr < ACK_MPDU_MIN_LEN || phr > MPDU_LEN) {
    return false;
  }
  return true;
}
/*---------------------------------------------------------------------------*/
static bool
radio_is_powered(void)
{
  return NRF_RADIO->POWER == 0 ? false : true;
}
/*---------------------------------------------------------------------------*/
static uint8_t
get_channel(void)
{
  return NRF_RADIO->FREQUENCY / 5 + 10;
}
/*---------------------------------------------------------------------------*/
static void
set_channel(uint8_t channel)
{
  NRF_RADIO->FREQUENCY = 5 * (channel - 10);
}
/*---------------------------------------------------------------------------*/
static void
cca_reconfigure(void)
{
  uint32_t ccactrl;

  ccactrl = rf_config.cca_mode;
  ccactrl |= rf_config.ed_threshold << RADIO_CCACTRL_CCAEDTHRES_Pos;
  ccactrl |= rf_config.cca_corr_count << RADIO_CCACTRL_CCACORRCNT_Pos;
  ccactrl |= rf_config.cca_corr_threshold << RADIO_CCACTRL_CCACORRTHRES_Pos;

  NRF_RADIO->CCACTRL = ccactrl;
}
/*---------------------------------------------------------------------------*/
static void
crc_init(void)
{
  /*
   * Initialise the CRC engine in .15.4 mode:
   * - Length: 2 bytes
   * - Polynomial:
   * - Initial value: 0
   */
  nrf_radio_crc_configure(CRC_IEEE802154_LEN, NRF_RADIO_CRC_ADDR_IEEE802154,
                          CRC_IEEE802154_POLY);

  nrf_radio_crcinit_set(CRC_IEEE802154_INIT);
}
/*---------------------------------------------------------------------------*/
static void
packet_init(void)
{
  /* Configure packet format for .15.4 */
  nrf_radio_packet_conf_t conf;

  memset(&conf, 0, sizeof(conf));

  conf.lflen = 8; /* Length field, in bits */
  conf.s1incl = false;
  conf.plen = NRF_RADIO_PREAMBLE_LENGTH_32BIT_ZERO;
  conf.crcinc = true;
  conf.big_endian = false;
  conf.whiteen = false;
  conf.maxlen = MPDU_LEN;

  nrf_radio_packet_configure(&conf);
}
/*---------------------------------------------------------------------------*/
static void
setup_interrupts(void)
{
  int_master_status_t stat;
  nrf_radio_int_mask_t interrupts = 0;

  stat = critical_enter();

  if(!rf_config.poll_mode) {
    nrf_radio_event_clear(NRF_RADIO_EVENT_CRCOK);
    nrf_radio_event_clear(NRF_RADIO_EVENT_CRCERROR);
    interrupts |= NRF_RADIO_INT_CRCOK_MASK | NRF_RADIO_INT_CRCERROR_MASK;
  }

  /* Make sure all interrupts are disabled before we enable selectively */
  nrf_radio_int_disable(0xFFFFFFFF);
  NVIC_ClearPendingIRQ(RADIO_IRQn);

  if(interrupts) {
    nrf_radio_int_enable(interrupts);
    NVIC_EnableIRQ(RADIO_IRQn);
  } else {
    /* No radio interrupts required. Make sure they are all off at the NVIC */
    NVIC_DisableIRQ(RADIO_IRQn);
  }

  critical_exit(stat);
}
/*---------------------------------------------------------------------------*/
/*
 * Set up timestamping with PPI:
 * - Enable the pre-programmed Channel 27: RADIO->END--->TIMER0->CAPTURE[2]
 * - Programme Channel 0 for RADIO->FRAMESTART--->TIMER0->CAPTURE[3]
 */
static void
setup_ppi_timestamping(void)
{
  nrf_ppi_channel_endpoint_setup(
    NRF_PPI_CHANNEL0,
    (uint32_t)nrf_radio_event_address_get(NRF_RADIO_EVENT_FRAMESTART),
    (uint32_t)nrf_timer_task_address_get(NRF_TIMER0, NRF_TIMER_TASK_CAPTURE3));
  nrf_ppi_channel_enable(NRF_PPI_CHANNEL0);
  nrf_ppi_channel_enable(NRF_PPI_CHANNEL27);
}
/*---------------------------------------------------------------------------*/
static void
set_poll_mode(bool enable)
{
  rf_config.poll_mode = enable;
  setup_interrupts();
}
/*---------------------------------------------------------------------------*/
static void
rx_buf_clear(void)
{
  memset(&rx_buf, 0, sizeof(rx_buf));
}
/*---------------------------------------------------------------------------*/
static void
rx_events_clear()
{
  nrf_radio_event_clear(NRF_RADIO_EVENT_FRAMESTART);
  nrf_radio_event_clear(NRF_RADIO_EVENT_END);
  nrf_radio_event_clear(NRF_RADIO_EVENT_CRCERROR);
  nrf_radio_event_clear(NRF_RADIO_EVENT_CRCOK);
}
/*---------------------------------------------------------------------------*/
/*
 * Powering off the peripheral will reset all registers to default values
 * This function here must be called at every power on to set the radio in a
 * known state
 */
static void
configure(void)
{
  nrf_radio_mode_set(NRF_RADIO_MODE_IEEE802154_250KBIT);

  set_channel(rf_config.channel);

  cca_reconfigure();

  /* Initialise the CRC engine in .15.4 mode */
  crc_init();

  /* Initialise the packet format */
  packet_init();

  /*
   * MODECNF: Fast ramp up, DTX=center
   * The Nordic driver is using DTX=0, but this is against the PS (v1.1 p351)
   */
  nrf_radio_modecnf0_set(true, RADIO_MODECNF0_DTX_Center);
}
/*---------------------------------------------------------------------------*/
/*
 * The caller must first make sure the radio is powered and configured.
 *
 * When we enter this function we can be in one of the following states:
 * -       STATE_RX: We were already in RX. Do nothing
 * -   STATE_RXIDLE: A reception just finished and we reverted to RXIDLE.
 *                   We just need to send the START task.
 * -   STATE_TXIDLE: A TX just finished and we reverted to TXIDLE.
 *                   We just need to send the START task.
 * - STATE_DISABLED: We just turned on. We need to request radio rampup
 */
static void
enter_rx(void)
{
  nrf_radio_state_t curr_state = nrf_radio_state_get();

  LOG_DBG("Enter RX, state=%u", curr_state);

  /* Do nothing if we are already in RX */
  if(curr_state == NRF_RADIO_STATE_RX) {
    LOG_DBG_(". Was in RX");
    LOG_DBG_("\n");
    return;
  }

  /* Prepare the RX buffer */
  nrf_radio_packetptr_set(&rx_buf);

  /* Initiate PPI timestamping */
  setup_ppi_timestamping();

  /* Make sure the correct interrupts are enabled */
  setup_interrupts();

  nrf_radio_shorts_enable(NRF_RADIO_SHORT_ADDRESS_RSSISTART_MASK);
  nrf_radio_shorts_enable(NRF_RADIO_SHORT_RXREADY_START_MASK);

  if(curr_state != NRF_RADIO_STATE_RXIDLE) {
    /* Clear EVENTS_RXREADY and trigger RXEN (which will trigger START) */
    nrf_radio_event_clear(NRF_RADIO_EVENT_RXREADY);
    nrf_radio_task_trigger(NRF_RADIO_TASK_RXEN);
  } else {
    /* Trigger the Start task */
    nrf_radio_task_trigger(NRF_RADIO_TASK_START);
  }

  LOG_DBG_("--->%u\n", nrf_radio_state_get());

  LOG_DBG("PACKETPTR=0x%08lx (rx_buf @ 0x%08lx)\n",
          (uint32_t)nrf_radio_packetptr_get(), (uint32_t)&rx_buf);
}
/*---------------------------------------------------------------------------*/
/* Retrieve an RSSI sample. The radio must be in RX mode */
static int8_t
rssi_read(void)
{
  uint8_t rssi_sample;

  nrf_radio_task_trigger(NRF_RADIO_TASK_RSSISTART);

  while(nrf_radio_event_check(NRF_RADIO_EVENT_RSSIEND) == false);
  nrf_radio_event_clear(NRF_RADIO_EVENT_RSSIEND);

  rssi_sample = nrf_radio_rssi_sample_get();

  return -((int8_t)rssi_sample);
}
/*---------------------------------------------------------------------------*/
/*
 * Convert the hardware-reported LQI to 802.15.4 range using an 8-bit
 * saturating multiplication by 4, as per the Product Spec.
 */
static uint8_t
lqi_convert_to_802154_scale(uint8_t lqi_hw)
{
  return (uint8_t)lqi_hw > 63 ? 255 : lqi_hw * ED_RSSISCALE;
}
/*---------------------------------------------------------------------------*/
/* Netstack API functions */
/*---------------------------------------------------------------------------*/
static int
on(void)
{
  LOG_DBG("On\n");

