contiki-ng/contiki-ng/arch/cpu/nrf52840/rf/nrf52840-ieee.c
  enter_rx();

  ENERGEST_ON(ENERGEST_TYPE_LISTEN);
  return NRF52840_COMMAND_OK;
}
/*---------------------------------------------------------------------------*/
static int
channel_clear(void)
{
  bool busy, idle;

  LOG_DBG("channel_clear\n");

  on();

  /* Clear previous CCA-related events, if any */
  nrf_radio_event_clear(NRF_RADIO_EVENT_CCABUSY);
  nrf_radio_event_clear(NRF_RADIO_EVENT_CCAIDLE);
  nrf_radio_event_clear(NRF_RADIO_EVENT_CCASTOPPED);

  LOG_DBG("channel_clear: CCACTRL=0x%08lx\n", NRF_RADIO->CCACTRL);

  /* We are now in RX. Send CCASTART */
  nrf_radio_task_trigger(NRF_RADIO_TASK_CCASTART);

  while((nrf_radio_event_check(NRF_RADIO_EVENT_CCABUSY) == false) &&
        (nrf_radio_event_check(NRF_RADIO_EVENT_CCAIDLE) == false));

  busy = nrf_radio_event_check(NRF_RADIO_EVENT_CCABUSY);
  idle = nrf_radio_event_check(NRF_RADIO_EVENT_CCAIDLE);

  LOG_DBG("channel_clear: I=%u, B=%u\n", idle, busy);

  if(busy) {
    return NRF52840_CCA_BUSY;
  }

  return NRF52840_CCA_CLEAR;
}
/*---------------------------------------------------------------------------*/
static int
init(void)
{
  LOG_DBG("Init\n");

  last_rssi = 0;
  last_lqi = 0;

  timestamps.sfd = 0;
  timestamps.framestart = 0;
  timestamps.end = 0;
  timestamps.mpdu_duration = 0;
  timestamps.phr = 0;

  /* Request the HF clock */
  nrf_clock_event_clear(NRF_CLOCK_EVENT_HFCLKSTARTED);
  nrf_clock_task_trigger(NRF_CLOCK_TASK_HFCLKSTART);
  while(!nrf_clock_event_check(NRF_CLOCK_EVENT_HFCLKSTARTED));
  nrf_clock_event_clear(NRF_CLOCK_EVENT_HFCLKSTARTED);

  /* Start the RF driver process */
  process_start(&nrf52840_ieee_rf_process, NULL);

  /* Prepare the RX buffer */
  rx_buf_clear();

  /* Configure radio */
  configure();

  /* Set up initial state of poll mode. This will configure interrupts. */
  set_poll_mode(rf_config.poll_mode);

  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
static int
prepare(const void *payload, unsigned short payload_len)
{
  LOG_DBG("Prepare %u bytes\n", payload_len);

  if(payload_len > MAX_PAYLOAD_LEN) {
    LOG_ERR("Too long: %u bytes, max %u\n", payload_len, MAX_PAYLOAD_LEN);
    return RADIO_TX_ERR;
  }

  /* Populate the PHR. Packet length, including the FCS */
  tx_buf.phr = (uint8_t)payload_len + FCS_LEN;

  /* Copy the payload over */
  memcpy(tx_buf.mpdu, payload, payload_len);

  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
static int
transmit(unsigned short transmit_len)
{
  int i;

  LOG_DBG("TX %u bytes + FCS, channel=%u\n", transmit_len, get_channel());

  if(transmit_len > MAX_PAYLOAD_LEN) {
    LOG_ERR("TX: too long (%u bytes)\n", transmit_len);
    return RADIO_TX_ERR;
  }

  on();

  if(rf_config.send_on_cca) {
    if(channel_clear() == NRF52840_CCA_BUSY) {
      LOG_DBG("TX: Busy\n");
      return RADIO_TX_COLLISION;
    }
  }

  nrf_radio_txpower_set(rf_config.txpower);

  /* When we reach here we are in state RX. Send a STOP to drop to RXIDLE */
  nrf_radio_task_trigger(NRF_RADIO_TASK_STOP);
  while(nrf_radio_state_get() != NRF_RADIO_STATE_RXIDLE);

  LOG_DBG("Transmit: %u bytes=000000", tx_buf.phr);
  for(i = 0; i < tx_buf.phr - 2; i++) {
    LOG_DBG_(" %02x", tx_buf.mpdu[i]);
  }
  LOG_DBG_("\n");

  LOG_DBG("TX Start. State %u", nrf_radio_state_get());

  /* Pointer to the TX buffer in PACKETPTR before task START */
  nrf_radio_packetptr_set(&tx_buf);

  /* Clear TX-related events */
  nrf_radio_event_clear(NRF_RADIO_EVENT_END);
  nrf_radio_event_clear(NRF_RADIO_EVENT_PHYEND);
  nrf_radio_event_clear(NRF_RADIO_EVENT_TXREADY);

  /* No need to sample RSSI during TX */
  nrf_radio_shorts_disable(NRF_RADIO_SHORT_ADDRESS_RSSISTART_MASK);

  /* Start the transmission */
  ENERGEST_SWITCH(ENERGEST_TYPE_LISTEN, ENERGEST_TYPE_TRANSMIT);

  /* Enable the SHORT between TXREADY and START before triggering TXRU */
  nrf_radio_shorts_enable(NRF_RADIO_SHORT_TXREADY_START_MASK);
  nrf_radio_task_trigger(NRF_RADIO_TASK_TXEN);

  /*
   * With fast rampup, the transition between TX and READY (TXRU duration)
   * takes 40us. This means we will be in TX mode in less than 3 rtimer ticks
   * (3x16=42 us). After this duration, we can busy wait for TX to finish.
   */
  RTIMER_BUSYWAIT(TXRU_DURATION_TIMER);

  LOG_DBG_("--->%u\n", nrf_radio_state_get());

  /* Wait for TX to complete */
  while(nrf_radio_state_get() == NRF_RADIO_STATE_TX);

  LOG_DBG("TX: Done\n");

  /*
   * Enter RX.
   * TX has finished and we are in state TXIDLE. enter_rx will handle the
   * transition from any state to RX, so we don't need to do anything further
   * here.
   */
  enter_rx();

  /* We are now in RX */
  ENERGEST_SWITCH(ENERGEST_TYPE_TRANSMIT, ENERGEST_TYPE_LISTEN);

  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
static int
send(const void *payload, unsigned short payload_len)
{
  prepare(payload, payload_len);
  return transmit(payload_len);
}
/*---------------------------------------------------------------------------*/
static int
read_frame(void *buf, unsigned short bufsize)
{
  int payload_len;

  /* Clear all events */
  rx_events_clear();

  payload_len = rx_buf.phr - FCS_LEN;

  if(phr_is_valid(rx_buf.phr) == false) {
    LOG_DBG("Incorrect length: %d\n", payload_len);
    rx_buf_clear();
    enter_rx();
    return 0;
  }

  memcpy(buf, rx_buf.mpdu, payload_len);
  last_lqi = lqi_convert_to_802154_scale(rx_buf.mpdu[payload_len]);
  last_rssi = -(nrf_radio_rssi_sample_get());

  packetbuf_set_attr(PACKETBUF_ATTR_RSSI, last_rssi);
  packetbuf_set_attr(PACKETBUF_ATTR_LINK_QUALITY, last_lqi);

  /* Latch timestamp values for this most recently received frame */
  timestamps.phr = rx_buf.phr;
  timestamps.framestart = nrf_timer_cc_read(NRF_TIMER0, NRF_TIMER_CC_CHANNEL3);
  timestamps.end = nrf_timer_cc_read(NRF_TIMER0, NRF_TIMER_CC_CHANNEL2);
  timestamps.mpdu_duration = rx_buf.phr * BYTE_DURATION_RTIMER;

  /*
   * Timestamp in rtimer ticks of the reception of the SFD. The SFD was
   * received 1 byte before the PHR, therefore all we need to do is subtract
   * 2 symbols (2 rtimer ticks) from the PPI FRAMESTART timestamp.
   */
  timestamps.sfd = timestamps.framestart - BYTE_DURATION_RTIMER;

  LOG_DBG("Read frame: len=%d, RSSI=%d, LQI=0x%02x\n", payload_len, last_rssi,
          last_lqi);

  rx_buf_clear();
  enter_rx();

  return payload_len;
}
/*---------------------------------------------------------------------------*/
static int
receiving_packet(void)
{
  /* If we are powered off, we are not receiving */
  if(radio_is_powered() == false) {
    return NRF52840_RECEIVING_NO;
  }

