contiki-ng/contiki-ng/arch/cpu/nrf52840/rf/nrf52840-ieee.c
  /* If our state is not RX, we are not receiving */
  if(nrf_radio_state_get() != NRF_RADIO_STATE_RX) {
    return NRF52840_RECEIVING_NO;
  }

  if(rf_config.poll_mode) {
    /* In poll mode, if the PHR is invalid we can return early */
    if(phr_is_valid(rx_buf.phr) == false) {
      return NRF52840_RECEIVING_NO;
    }

    /*
     * If the PHR is valid and we are actually on, inspect EVENTS_CRCOK and
     * _CRCERROR. If both of them are clear then reception is ongoing
     */
    if((nrf_radio_event_check(NRF_RADIO_EVENT_CRCOK) == false) &&
       (nrf_radio_event_check(NRF_RADIO_EVENT_CRCERROR) == false)) {
      return NRF52840_RECEIVING_YES;
    }

    return NRF52840_RECEIVING_NO;
  }

  /*
   * In non-poll mode, we are receiving if the PHR is valid but the buffer
   * does not contain a full packet.
   */
  if(phr_is_valid(rx_buf.phr) == true && rx_buf.full == false) {
    return NRF52840_RECEIVING_YES;
  }
  return NRF52840_RECEIVING_NO;
}
/*---------------------------------------------------------------------------*/
static int
pending_packet(void)
{
  /*
   * First check if we have received a PHR. When we enter RX the value of the
   * PHR in our RX buffer is zero so we can return early.
   */
  if(phr_is_valid(rx_buf.phr) == false) {
    return NRF52840_PENDING_NO;
  }

  /*
   * We have received a valid PHR. Either we are in the process of receiving
   * a frame, or we have fully received one. If we have received a frame then
   * EVENTS_CRCOK should be asserted. In poll mode that's enough. In non-poll
   * mode the interrupt handler will clear the event (else the interrupt would
   * fire again), but we save the state in rx_buf.full.
   */
  if((nrf_radio_event_check(NRF_RADIO_EVENT_CRCOK) == true) ||
     (rx_buf.full == true)) {
    return NRF52840_PENDING_YES;
  }

  return NRF52840_PENDING_NO;
}
/*---------------------------------------------------------------------------*/
static int
off(void)
{
  nrf_radio_task_trigger(NRF_RADIO_TASK_DISABLE);

  ENERGEST_OFF(ENERGEST_TYPE_LISTEN);

  return NRF52840_COMMAND_OK;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_value(radio_param_t param, radio_value_t *value)
{
  if(!value) {
    return RADIO_RESULT_INVALID_VALUE;
  }

  switch(param) {
  case RADIO_PARAM_POWER_MODE:
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CHANNEL:
    *value = (radio_value_t)get_channel();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RX_MODE:
    *value = 0;
    if(rf_config.poll_mode) {
      *value |= RADIO_RX_MODE_POLL_MODE;
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TX_MODE:
    *value = 0;
    if(rf_config.send_on_cca) {
      *value |= RADIO_TX_MODE_SEND_ON_CCA;
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TXPOWER:
    *value = (radio_value_t)rf_config.txpower;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CCA_THRESHOLD:
    *value = (radio_value_t)rf_config.cca_corr_threshold;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RSSI:
    *value = (radio_value_t)rssi_read();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_LAST_RSSI:
    *value = (radio_value_t)last_rssi;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_LAST_LINK_QUALITY:
    *value = (radio_value_t)last_lqi;
    return RADIO_RESULT_OK;
  case RADIO_CONST_CHANNEL_MIN:
    *value = 11;
    return RADIO_RESULT_OK;
  case RADIO_CONST_CHANNEL_MAX:
    *value = 26;
    return RADIO_RESULT_OK;
  case RADIO_CONST_TXPOWER_MIN:
    *value = (radio_value_t)RADIO_TXPOWER_TXPOWER_Neg40dBm;
    return RADIO_RESULT_OK;
  case RADIO_CONST_TXPOWER_MAX:
    *value = (radio_value_t)RADIO_TXPOWER_TXPOWER_Pos8dBm;
    return RADIO_RESULT_OK;
  case RADIO_CONST_PHY_OVERHEAD:
    *value = (radio_value_t)RADIO_PHY_OVERHEAD;
    return RADIO_RESULT_OK;
  case RADIO_CONST_BYTE_AIR_TIME:
    *value = (radio_value_t)RADIO_BYTE_AIR_TIME;
    return RADIO_RESULT_OK;
  case RADIO_CONST_DELAY_BEFORE_TX:
    *value = (radio_value_t)RADIO_DELAY_BEFORE_TX;
    return RADIO_RESULT_OK;
  case RADIO_CONST_DELAY_BEFORE_RX:
    *value = (radio_value_t)RADIO_DELAY_BEFORE_RX;
    return RADIO_RESULT_OK;
  case RADIO_CONST_DELAY_BEFORE_DETECT:
    *value = (radio_value_t)RADIO_DELAY_BEFORE_DETECT;
    return RADIO_RESULT_OK;
  case RADIO_CONST_MAX_PAYLOAD_LEN:
    *value = (radio_value_t)MAX_PAYLOAD_LEN;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_PAN_ID:
  case RADIO_PARAM_16BIT_ADDR:
  default:
    return RADIO_RESULT_NOT_SUPPORTED;
  }
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_value(radio_param_t param, radio_value_t value)
{
  switch(param) {
  case RADIO_PARAM_POWER_MODE:
    if(value == RADIO_POWER_MODE_ON) {
      on();
      return RADIO_RESULT_OK;
    }
    if(value == RADIO_POWER_MODE_OFF) {
      off();
      return RADIO_RESULT_OK;
    }
    return RADIO_RESULT_INVALID_VALUE;
  case RADIO_PARAM_CHANNEL:
    if(value < NRF52840_CHANNEL_MIN ||
       value > NRF52840_CHANNEL_MAX) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    rf_config.channel = value;

    /* If we are powered on, apply immediately. */
    if(radio_is_powered()) {
      off();
      set_channel(value);
      on();
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RX_MODE:
    if(value & ~(RADIO_RX_MODE_ADDRESS_FILTER |
                 RADIO_RX_MODE_AUTOACK |
                 RADIO_RX_MODE_POLL_MODE)) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    set_poll_mode((value & RADIO_RX_MODE_POLL_MODE) != 0);

    return RADIO_RESULT_OK;
  case RADIO_PARAM_TX_MODE:
    if(value & ~(RADIO_TX_MODE_SEND_ON_CCA)) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    rf_config.send_on_cca = (value & RADIO_TX_MODE_SEND_ON_CCA) != 0;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TXPOWER:
    rf_config.txpower = value;
    /* If we are powered on, apply immediately. */
    if(radio_is_powered()) {
      nrf_radio_txpower_set(value);
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CCA_THRESHOLD:
    rf_config.cca_corr_threshold = value;
    /* If we are powered on, apply immediately. */
    if(radio_is_powered()) {
      cca_reconfigure();
    }
    return RADIO_RESULT_OK;

  case RADIO_PARAM_SHR_SEARCH:
  case RADIO_PARAM_PAN_ID:
  case RADIO_PARAM_16BIT_ADDR:
  default:
    return RADIO_RESULT_NOT_SUPPORTED;
  }
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_object(radio_param_t param, void *dest, size_t size)
{
  if(param == RADIO_PARAM_LAST_PACKET_TIMESTAMP) {
    if(size != sizeof(rtimer_clock_t) || !dest) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    *(rtimer_clock_t *)dest = timestamps.sfd;
    return RADIO_RESULT_OK;
  }

