contiki-ng/contiki-ng/arch/cpu/nrf52840/rf/nrf52840-ieee.c
#if MAC_CONF_WITH_TSCH
  if(param == RADIO_CONST_TSCH_TIMING) {
    if(size != sizeof(uint16_t *) || !dest) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    /* Assigned value: a pointer to the TSCH timing in usec */
    *(const uint16_t **)dest = tsch_timeslot_timing_us_10000;
    return RADIO_RESULT_OK;
  }
#endif /* MAC_CONF_WITH_TSCH */

  /* The radio does not support h/w frame filtering based on addresses */
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_object(radio_param_t param, const void *src, size_t size)
{
  /* The radio does not support h/w frame filtering based on addresses */
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
const struct radio_driver nrf52840_ieee_driver = {
  init,
  prepare,
  transmit,
  send,
  read_frame,
  channel_clear,
  receiving_packet,
  pending_packet,
  on,
  off,
  get_value,
  set_value,
  get_object,
  set_object
};
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(nrf52840_ieee_rf_process, ev, data)
{
  int len;
  PROCESS_BEGIN();

  while(1) {
    PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);

    LOG_DBG("Polled\n");

    if(pending_packet()) {
      watchdog_periodic();
      packetbuf_clear();
      len = read_frame(packetbuf_dataptr(), PACKETBUF_SIZE);
      if(len > 0) {
        packetbuf_set_datalen(len);
        NETSTACK_MAC.input();
        LOG_DBG("last frame (%u bytes) timestamps:\n", timestamps.phr);
        LOG_DBG("      SFD=%lu (Derived)\n", timestamps.sfd);
        LOG_DBG("      PHY=%lu (PPI)\n", timestamps.framestart);
        LOG_DBG("     MPDU=%lu (Duration)\n", timestamps.mpdu_duration);
        LOG_DBG("      END=%lu (PPI)\n", timestamps.end);
        LOG_DBG(" Expected=%lu + %u + %lu = %lu\n", timestamps.sfd,
                BYTE_DURATION_RTIMER, timestamps.mpdu_duration,
                timestamps.sfd + BYTE_DURATION_RTIMER + timestamps.mpdu_duration);
      }
    }
  }

  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
void
RADIO_IRQHandler(void)
{
  if(!rf_config.poll_mode) {
    if(nrf_radio_event_check(NRF_RADIO_EVENT_CRCOK)) {
      nrf_radio_event_clear(NRF_RADIO_EVENT_CRCOK);
      rx_buf.full = true;
      process_poll(&nrf52840_ieee_rf_process);
    } else if(nrf_radio_event_check(NRF_RADIO_EVENT_CRCERROR)) {
      nrf_radio_event_clear(NRF_RADIO_EVENT_CRCERROR);
      rx_buf_clear();
      enter_rx();
    }
  }
}
/*---------------------------------------------------------------------------*/
/**
 * @}
 * @}
 * @}
 */
